УправлениеВетеринарнойКлиникой/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Питомцы</name>
    <attributes>
      <name>Кличка</name>
      <type>
        <types>CatalogRef.Питомцы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЖивотного</name>
      <type>
        <types>CatalogRef.ВидыЖивотных</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаЖивотного</name>
      <type>
        <types>CatalogRef.ПородыЖивотных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УправлениеВетеринарнойКлиникой/src/Catalogs/Питомцы/Питомцы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Питомцы</name>
  <attributes>
    <name>Хозяин</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЖивотного</name>
    <type>
      <types>CatalogRef.ВидыЖивотных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПородаЖивотного</name>
    <type>
      <types>CatalogRef.ПородыЖивотных</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолЖивотного</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧипПаспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аллергии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеВетеринарнойКлиникой/src/Catalogs/Клиенты/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьПитомцев();
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбновитьПитомцев(Команда)
	ЗаполнитьПитомцев();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПитомцев()
	
	Объект.Питомцы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Питомцы.ВидЖивотного КАК ВидЖивотного,
	|	Питомцы.ПородаЖивотного КАК ПородаЖивотного,
	|	Питомцы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Питомцы КАК Питомцы
	|ГДЕ
	|	Питомцы.Хозяин = &Хозяин";
	
	Запрос.УстановитьПараметр("Хозяин", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Питомцы.Добавить();
		НоваяСтрока.Кличка = Выборка.Ссылка;
		НоваяСтрока.ВидЖивотного = Выборка.ВидЖивотного;
		НоваяСтрока.ПородаЖивотного = Выборка.ПородаЖивотного
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
